src/Documents/Возврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Возврат</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Comment>для группировки по сменам</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПосадочноеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПосадочныеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>без скидок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныУдалений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОплаты</Name>
					<Comment>для отчета по выручке</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заблокирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКартыЛояльности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассоваяСмена</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Касса_ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработанСистемойЛояльности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМрабочегоМеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиЗаказа</Name>
							<Comment>в исходном заказе</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУдалено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>фактовая</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фирма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПДФ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>68</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШК</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>фАлкоголь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНачальное</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяДобавления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаРозничная</Name>
							<Comment>без скидок</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРозничная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусОплаты</Name>
							<Comment>-1: к оплате; 0 - не оплачен; 1: оплачен</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Специфики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТовара</Name>
							<Comment>для связи с товарами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиСпецифики</Name>
							<Comment>для вложенных специфик</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специфика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Специфики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/Удаление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>Удаление</Name>
			<Comment>заказа или позиции</Comment>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Comment>для группировки по сменам</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеСмены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПосадочноеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПосадочныеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Comment>без скидок</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныУдалений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Специфики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Специфика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Специфики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/CommonModules/ОперативнаяСводка/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ДЛЯ ФОРМИРОВАНИЯ ОПЕРАТИВНОЙ СВОДКИ В БЭКе

Функция ПолучитьОперативнуюТаблицуРеализации(ТаблицаПараметров) Экспорт
	
	ТекстЗапроса = "
		// ТОВАРЫ
		// товары реализация
		|ВЫБРАТЬ
		|	Ссылка.МестоРеализации.Код			КАК МестоРеализации,
		|	ГруппаОплаты.Код 					КАК ГруппаОплаты,
		|	ВЫБОР КОГДА Товар.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА Товар.Наименование 
		|		ИНАЧЕ Товар.Номенклатура.Наименование 
		|	КОНЕЦ								КАК Наименование,
 		|	Товар.Номенклатура.Код 				КАК Код,
		|	Количество * Товар.КоэфПересчета	КАК КоличествоПродано,
		|	СуммаРеализации						КАК СуммаПродано,
		|	0 									КАК КоличествоСписать,
		|	0 									КАК СуммаСписать,
		|	0 									КАК КоличествоВозврат,
		|	0 									КАК СуммаВозврат
		|ИЗ
		|	Документ.Заказ.Товары
		|ГДЕ
		|	НЕ Ссылка.ПометкаУдаления
		|	И Ссылка.МестоРеализации.Код = &КодМестаРеализации
		|	И Ссылка.Дата >= &ДатаС
		|	И Количество <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ

		// товары возвраты
		|ВЫБРАТЬ
		|	Ссылка.МестоРеализации.Код			КАК МестоРеализации,
		|	ГруппаОплаты.Код 					КАК ГруппаОплаты,
		|	ВЫБОР КОГДА Товар.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА Товар.Наименование 
		|		ИНАЧЕ Товар.Номенклатура.Наименование 
		|	КОНЕЦ								КАК Наименование,
 		|	Товар.Номенклатура.Код 				КАК Код,
		|	0									КАК КоличествоПродано,
		|	0									КАК СуммаПродано,
		|	0 									КАК КоличествоСписать,
		|	0 									КАК СуммаСписать,
		|	Количество * Товар.КоэфПересчета	КАК КоличествоВозврат,
		|	Сумма								КАК СуммаВозврат
		|ИЗ
		|	Документ.Возврат.Товары
		|ГДЕ
		|	НЕ Ссылка.ПометкаУдаления
		|	И Ссылка.МестоРеализации.Код = &КодМестаРеализации
		|	И Ссылка.Причина.Списание
		|	И Ссылка.Дата >= &ДатаС
		|
		|ОБЪЕДИНИТЬ ВСЕ

		// товары удаления
		|ВЫБРАТЬ
		|	МестоРеализации.Код					КАК МестоРеализации,
		|	ГруппаОплаты.Код 					КАК ГруппаОплаты,
		|	ВЫБОР КОГДА Товар.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|		ТОГДА Товар.Наименование 
		|		ИНАЧЕ Товар.Номенклатура.Наименование 
		|	КОНЕЦ								КАК Наименование,
 		|	Товар.Номенклатура.Код 				КАК Код,
		|	0									КАК КоличествоПродано,
		|	0									КАК СуммаПродано,
		|	Количество * Товар.КоэфПересчета	КАК КоличествоСписать,
		|	Сумма								КАК СуммаСписать,
		|	0									КАК КоличествоВозврат,
		|	0									КАК СуммаВозврат
		|ИЗ
		|	Документ.Удаление
		|ГДЕ
		|	НЕ ПометкаУдаления
		|	И МестоРеализации.Код = &КодМестаРеализации
		|	И Причина.Списание
		|	И Дата >= &ДатаС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		
		// СПЕЦИФИКА (вся специфика идет в списание)
		// специфика реализация
		|ВЫБРАТЬ
		|	Ссылка.МестоРеализации.Код			КАК МестоРеализации,
		|	ГруппаОплаты.Код 					КАК ГруппаОплаты,
		|	Специфика.Номенклатура.Наименование КАК Наименование,
 		|	Специфика.Номенклатура.Код 			КАК Код,
		|	0									КАК КоличествоПродано,
		|	0									КАК СуммаПродано,
		|	Количество * Специфика.КоэфПересчета КАК КоличествоСписать,
		|	0 									КАК СуммаСписать,
		|	0 									КАК КоличествоВозврат,
		|	0 									КАК СуммаВозврат
		|ИЗ
		|	Документ.Заказ.Специфики
		|ГДЕ
		|	НЕ Ссылка.ПометкаУдаления
		|	И Ссылка.МестоРеализации.Код = &КодМестаРеализации
		|	И Ссылка.Дата >= &ДатаС
		|	И Количество <> 0
		|	И Специфика.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Специфики.ПустаяСсылка)
		|
		|ОБЪЕДИНИТЬ ВСЕ

		// специфика возвраты
		|ВЫБРАТЬ
		|	Ссылка.МестоРеализации.Код			КАК МестоРеализации,
		|	ГруппаОплаты.Код 					КАК ГруппаОплаты,
		|	Специфика.Номенклатура.Наименование КАК Наименование,
 		|	Специфика.Номенклатура.Код 			КАК Код,
		|	0									КАК КоличествоПродано,
		|	0									КАК СуммаПродано,
		|	-Количество * Специфика.КоэфПересчета КАК КоличествоСписать,
		|	0 									КАК СуммаСписать,
		|	0 									КАК КоличествоВозврат,
		|	0 									КАК СуммаВозврат
		|ИЗ
		|	Документ.Возврат.Специфики
		|ГДЕ
		|	НЕ Ссылка.ПометкаУдаления
		|	И Ссылка.МестоРеализации.Код = &КодМестаРеализации
		|	И Ссылка.Причина.Списание
		|	И Ссылка.Дата >= &ДатаС
		|
		|ОБЪЕДИНИТЬ ВСЕ

		// специфика удаления
		|ВЫБРАТЬ
		|	Ссылка.МестоРеализации.Код			КАК МестоРеализации,
		|	Ссылка.ГруппаОплаты.Код 			КАК ГруппаОплаты,
		|	Специфика.Номенклатура.Наименование	КАК Наименование,
 		|	Специфика.Номенклатура.Код 			КАК Код,
		|	0									КАК КоличествоПродано,
		|	0									КАК СуммаПродано,
		|	Ссылка.Количество * Специфика.КоэфПересчета КАК КоличествоСписать,
		|	0	 								КАК СуммаСписать,
		|	0									КАК КоличествоВозврат,
		|	0									КАК СуммаВозврат
		|ИЗ
		|	Документ.Удаление.Специфики
		|ГДЕ
		|	НЕ Ссылка.ПометкаУдаления
		|	И Ссылка.МестоРеализации.Код = &КодМестаРеализации
		|	И Ссылка.Причина.Списание
		|	И Ссылка.Дата >= &ДатаС
		|";
		
	ТаблицаРезультата = ВыполнитьЗапрос(ТекстЗапроса, ТаблицаПараметров);
	ТаблицаРезультата.Свернуть("МестоРеализации, ГруппаОплаты, Наименование, Код",
								"КоличествоПродано, СуммаПродано, КоличествоСписать, СуммаСписать, КоличествоВозврат, СуммаВозврат");
	
	Возврат ТаблицаРезультата;
КонецФункции

Функция ПолучитьОперативнуюТаблицуВыручки(ТаблицаПараметров) Экспорт
	
	ТекстЗапроса = "
		// выручка
		|ВЫБРАТЬ
		|	Ссылка.МестоРеализации.Код			КАК МестоРеализации,
		|	Ссылка.ГруппаОплаты.Код 			КАК ГруппаОплаты,
		|	ВариантОплаты.Наименование			КАК ВариантОплаты,
		|	ВариантОплаты.Тип					КАК ТипОплатыСсылка,
		|	СуммаФакт							КАК Сумма,
		|	0 									КАК СуммаВозврат
		|ИЗ
		|	Документ.ПротоколРасчетов.Протокол
		|ГДЕ
		|	НЕ Ссылка.ПометкаУдаления И НЕ Ссылка.Неучетный
		|	И ВариантОплаты <> ЗНАЧЕНИЕ(Справочник.ВариантыОплаты.ПустаяСсылка)
		|	И Ссылка.МестоРеализации.Код = &КодМестаРеализации
		|	И Ссылка.Дата >= &ДатаС
		|
		|ОБЪЕДИНИТЬ ВСЕ

		// возвраты
		|ВЫБРАТЬ
		|	Ссылка.МестоРеализации.Код			КАК МестоРеализации,
		|	ГруппаОплаты.Код 					КАК ГруппаОплаты,
		|	Ссылка.ВариантОплаты.Наименование	КАК ВариантОплаты,
		|	Ссылка.ВариантОплаты.Тип			КАК ТипОплатыСсылка,
		|	0									КАК Сумма,
		|	Сумма								КАК СуммаВозврат
		|ИЗ
		|	Документ.Возврат.Товары
		|ГДЕ
		|	НЕ Ссылка.ПометкаУдаления
		|	И Ссылка.МестоРеализации.Код = &КодМестаРеализации
		|	И Ссылка.Дата >= &ДатаС
		|";
		
	ТаблицаРезультата = ВыполнитьЗапрос(ТекстЗапроса, ТаблицаПараметров);
	ТаблицаРезультата.Свернуть("МестоРеализации, ГруппаОплаты, ВариантОплаты, ТипОплатыСсылка",
								"Сумма, СуммаВозврат");
								
	ТаблицаРезультата.Колонки.Добавить("ТипОплаты");
	Для каждого Строка Из ТаблицаРезультата Цикл
		Строка.ТипОплаты = Строка(Строка.ТипОплатыСсылка);
	КонецЦикла; 
	ТаблицаРезультата.Колонки.Удалить("ТипОплатыСсылка");
	
	Возврат ТаблицаРезультата;
КонецФункции

Функция ВыполнитьЗапрос(ТекстЗапроса, ТаблицаПараметров)

	Для каждого СтрокаПараметров Из ТаблицаПараметров Цикл
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("КодМестаРеализации"	,СокрЛП(СтрокаПараметров.КодМестаРеализации));
		Запрос.УстановитьПараметр("ДатаС"				,СтрокаПараметров.ДатаНачала);
		
		Результат = Запрос.Выполнить();
		
		Если ТаблицаПараметров.Индекс(СтрокаПараметров)=0 Тогда
			ТаблицаРезультата = Результат.Выгрузить();
		Иначе
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(ТаблицаРезультата.Добавить(), Выборка);
			КонецЦикла; 
		КонецЕсли; 
		
	КонецЦикла;
	
	Возврат ТаблицаРезультата;
КонецФункции
